package _book;

/**
 * @author 734070824@qq.com
 * @date 2018/5/24 20:29
 */
public class Node {

    //书签
        //算法第四版 283 (296 / 649) 3.3.4.1 红黑树
        //算法第四版 337 (350 / 649) 4.1.2.3 图的处理算法的设计模式 20180902
        //算法第四版 352 (365 / 649) 图先到这里 20180906 先看字符串
        //算法第四版 458 (471 / 649) LSD 20180906 低位优先的字符串排序算法

    //TODO 重新阅读第二章, 习题感觉很是困难
    //TODO 看到 快速排序,
    //TODO 先看 树 相关 然后再看快速排序后面的
    //TODO 红黑树 删除
    //TODO union-find
    //TODO 第一章



    //TODO思考
        //TODO 为什么散列表使用大小为素数的M的数组
        //TODO 0x7FFFFFFF这个值得意义
        //TODO 线性探测散列表中 删除 之后, 后面的key在重新插入之后, 如何保证插入后的key不会重新进入循环
            //最多是那个位置
            //i+1
}
