package _book;

/**
 * @author 734070824@qq.com
 * @date 2018/5/24 20:29
 */
public class Node {

    //书签
        //算法第四版 283 (296 / 649) 3.3.4.1 红黑树
        //算法第四版 337 (350 / 649) 4.1.2.3 图的处理算法的设计模式 20180902
        //算法第四版 352 (365 / 649) 图先到这里 20180906 先看字符串
        //算法第四版 458 (471 / 649) LSD 20180906 低位优先的字符串排序算法
        //算法第四版 高位优先的字符串排序算法 看着有些困难 重新开始

    //20180918
        //算法第四版 跳过归并排序--算法改进 187 (200 / 649)
        //算法第四版 195 (208 / 649) 优先队列



    //TODO 重新阅读第二章, 习题感觉很是困难
    //TODO 看到 快速排序,
    //TODO 先看 树 相关 然后再看快速排序后面的
    //TODO 红黑树 删除
    //TODO union-find
    //TODO 第一章



}
